Reddit/app/views/users/show.html.erb


<% @user.subs.each do |sub| %>
---
SELECT "subs".* FROM "subs" WHERE "subs"."user_id" = $1  [["user_id", 2]]