Reddit/app/views/subs/show.html.erb

<h1><%=User.find_by(id: @sub.user_id).username%>'s Sub</h1>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    <label>Moderator:
        <%=User.find_by(id: @sub.user_id).username%>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]